package com.company;
//Напишите программу вывода всех четных чисел от 2 до 100 включительною
public class Main {

        public static void main(String[] args) {

            for(int i=2; i<=100; i += 2){// write your code here
                ;System.out.println(i);{

                }


            }
        }
    }
// write your code here}

